{
  "data": {
    "proposals": [
      {
        "id": "0x729c19f1cafab8ed884914549e147ef401532cf6680e340a1aa0c8cc65f35f09",
        "title": "[Consensus Check] Should Uniswap v3 be deployed to Gnosis Chain?",
        "body": "## Context\n\nAfter passing the [Temperature Check vote](https://snapshot.org/#/uniswap/proposal/0xb328c7583c0f1ea85f8a273dd36977c95e47c3713744caf7143e68b65efcc8a5) with 7M UNI voting in favor of deploying Uniswap v3 on Gnosis Chain (GC), we are creating this post to move forward into the Consensus Check stage.\n\nComments on [the previous post](https://gov.uniswap.org/t/temperature-check-should-uniswap-v3-be-deployed-to-gnosis-chain/16513) expressed support for v3 deployment on GC, but also suggested more clarity on the following topics:\n\n* The team that will be deploying Uniswap v3 on GC\n* The bridge used to facilitate cross-chain governance for Uniswap v3 on GC\n* The details of liquidity incentives provided, including timelines and logistics for transferring funds\n\nWe have updated this post accordingly and provided more details on each of these items.\n\n## About Gnosis Chain\n\nIn production since 2018 (as the xDai Chain), the rebranded [Gnosis Chain](https://www.gnosischain.com/) is rapidly evolving with a new focus and mission. Gnosis Chain (GC) provides a real-world value chain that closely mirrors the Ethereum 2.0 ecosystem. This includes a beacon chain framework, rollups, and other vital functionality. GC will serve in a front-running capacity for important Ethereum 2.0 updates.\n\nTuned parameters on Gnosis Chain enable faster blocks and epochs, low-cost stable transactions, and the opportunity to construct trustless bridges and conduct seamless transfers between GC and the Ethereum 2.0 mainnet.\n\n## Proposal\n\nThe Gnosis Chain team is committed to ecosystem development, adoption, and growth as the Eth2.0 landscape comes into focus. With a mission to “accelerate Ethereum,” Gnosis Chain is poised for expansion. With this in mind, we propose a Uniswap v3 deployment to Gnosis Chain. We believe there are many benefits for both Uniswap Labs and Uniswap users, some of which include:\n\n1. A DeFi ecosystem primed for growth. Once deployed, Uniswap would become a cornerstone DeFi engine for protocols using and interacting within the ecosystem. Perpetual Protocol is a flagship protocol on GC that relies on Uniswap v3. This deployment will enable Perpetual to continue to flourish on the Gnosis Chain. Additional bluechip app deployments with growing TVL include Curve, Sushiswap, and Tornado Cash, with many new and promising DeFi projects choosing Gnosis Chain as their home base. A list of current projects is available at [https://gnosischain.world/\n](https://gnosischain.world/)\n2. An iterative environment. Uniswap Labs can experiment with new functionality and alpha test new features in a real-value environment (which differs from a test environment in that users behave differently with value on the line, token supply is limited, real adversaries exist, etc). Uniswap can spot and remediate any final potential issues stemming from important Ethereum updates prior to mainnet activation and take advantage of optimized slot and epoch times for faster iteration.\n\n3. Tight Ethereum compatibility. Tools, resources, projects, and protocols supported by Ethereum are already supported on Gnosis Chain, with more onboarding regularly. Gnosis Safe is facilitating daily operations for many existing projects. [A trustless bridge architecture designed to connect Ethereum and Gnosis Chain is in the works](https://hackmd.io/g8TK7IzYQjClTTaor-ypIQ). The [Gnosis Beacon Chain validator set](https://beacon.gnosischain.com/) is expanding rapidly bringing massive decentralization to the chain.\nThe primary differences separating the GBC from the Ethereum Beacon chain include 5-second blocks and < 2-minute epochs, stable transactions with a max target of $.01 per 100K gas, and an economically and geographically diverse validator set, and a lower-stakes, lower-TVL environment.\n\n4. Unique chain characteristics. Stable, low-cost transactions provide unique opportunities for Uniswap users. When gas costs are known and have a low impact on trade decisions, new strategies and approaches emerge which are currently untenable on the Ethereum mainnet or other chains with wide-ranging fee variability.\n\n5. User incentives. A large directive for the Gnosis Chain is to increase the user base and on-chain activity by strategically allocating funds from the GnosisDAO treasury to promote adoption. An ecosystem fund has been created for this purpose, and we propose to use a portion of these funds to promote Uniswap v3 on Gnosis Chain. We propose providing up to $10M to incentivize the adoption of Uniswap v3 on Gnosis Chain.\n\n## Details for incentivized Adoption of Uniswap v3\n\nThe $10M will be provided in GNO to foster the usage of Uniswap v3 on Gnosis Chain. The incentives should be designed together with other projects, which are operating on top of Uniswap v3 such as Perpetual Protocol, Gelato, or Stakewise. This should allow for more sustainable utilization of Uniswap as Gnosis Chain doesn’t have a team dedicated to Uniswap v3. The GNO can be used to incentivize liquidity but should not be limited to this use case. Anything increasing usage of Uniswap v3, including building new applications on top of Uniswap v3 should be supported. The goal is to spend the $10M in the time period of 2 years. Funds not used after two years would go back to GnosisDAO. The spending is limited to $10M and the transferred amount of GNO as part of the proposal. GnosisDAO can decide to top up this amount based on the outcome of this initiative.\n\n## Cross-Chain Governance with Nomad\n\nSince the Temperature Check, we have discussed with stakeholders within the Uniswap ecosystem, who have expressed a desire to see trust-minimized bridges used for governance for new Uniswap v3 deployments. In addition, we’ve also seen the [Nomad](http://nomad.xyz) team’s proposal to [deploy v3 on Moonbeam](https://gov.uniswap.org/t/consensus-check-deploy-uniswap-v3-to-moonbeam/16624), which includes a section addressing this, as well as documenting the current fragmented approach to governance across various v3 deployments.\n\nIn the interest of taking a standardized approach to cross-chain governance of v3 deployments moving forward, we’ve partnered with the Nomad team to leverage the Nomad generalized message passing channels to manage the governance of the Uniswap v3 deployment on Gnosis Chain.\n\nWe believe that Nomad is the best solution for cross-chain governance, as it:\n\n* [Supports generalized messages](https://docs.nomad.xyz/) between chains\n* Does not rely on a multi-sig or validator set, but rather leverages an optimistic mechanism that allows bad messages to be challenged via fraud proofs\n\nNomad will be deployed on Gnosis Chain shortly and will leverage [Gnosis Zodiac Modules](https://github.com/gnosis/zodiac) as part of its governance stack.\n\nWe are excited about partnering with Nomad to create a trust-minimized governance stack that can offer a standard for the Uniswap ecosystem.\n\n## License Exemption\n\nWe are requesting an exemption that will allow Gnosis Ltd. to use the Licensed Work to deploy it on Gnosis Chain, a layer 1 blockchain with deep connections to Ethereum, provided that the deployment is subject to Ethereum layer 1 Uniswap Protocol governance and control.\n\n## Timeline\n\nFollowing the Consensus Check phase, we will submit this proposal shortly after to an on-chain vote. Provided that the proposal passes both steps, and all governance systems have been built and audited, we will be ready to move forward with the Uniswap v3 deployment on Gnosis Chain.\n\n## Proposal Acceptance and Execution\n\nAs the proposal funding has to come from GnosisDAO, this proposal has to be accepted by both: UNI and GNO token holders. The execution of this proposal is dependent also on the acceptance of the proposal by GnosisDAO. The GnosisDAO proposal has to include the setup of the multi-sig and the allocation of GNO and would be executed once it is accepted by GNO token holders. Two singers from the Uniswap community and two singers from the GnosisDAO community should be selected to participate in the multisig wallet.\n\n## Conclusion\n\nThe Gnosis Chain is preparing for substantial growth in the coming year. We have implemented an aggressive infrastructure grants program including large grants to Nethermind, Lighthouse and Erigon client teams to support base-layer functionality and security. The [ecosystem fund](https://forum.gnosis.io/t/gip-16-gnosis-chain-xdai-gnosis-merge/1904) will bring in many new projects, and we feel Uniswap v3 is an essential component that will serve as a foundational layer for this growth.\n\nWe welcome any questions and comments and are happy to provide any clarifications as needed. We are excited to submit this proposal to the Uniswap community and look forward to your feedback! Thank you.",
        "choices": [
          "Yes",
          "No"
        ],
        "start": 1649869355,
        "end": 1650279600,
        "snapshot": "14578337",
        "state": "closed",
        "author": "0x6d9ABa400a2a487a5Fb76c6d56518835553CD284",
        "scores": [
          13934451.577716827,
          10.733100408190802
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      },
      {
        "id": "QmcVpxCSkL8rPmZgow8uL2GbdPZtUKS3huY9aSExKNfEK6",
        "title": "[Consensus Check] Deploy Uniswap V3 on Moonbeam",
        "body": "## Proposal Topic\n\n[Blockchain at Berkeley](https://blockchain.berkeley.edu) is creating this proposal in partnership with [Nomad](https://www.docs.nomad.xyz/) to Deploy Uniswap V3 on Moonbeam.\n\n\n## Process Update\n\nThe [Temperature Check](https://gov.uniswap.org/t/temperature-check-deploy-uniswap-v3-on-moonbeam/16572) for this proposal passed with 8.3M UNI voting Yes on the [Snapshot](https://snapshot.org/#/uniswap/proposal/QmaG6nJYW3xLeQwAa6xxhpbuYS8h6PVQpbx1vfqpqxAtik). We now move to the Consensus Check phase to collect further feedback in advance of an on-chain vote.\n\n## Summary\n\nIn support of furthering the vision of [Multichain Uniswap](https://uniswap.org/blog/multichain-uniswap), we propose that the Uniswap community vote to authorize the deployment of Uniswap V3 to Moonbeam. We hope this proposal will serve as an example to create a generalizable, trust-minimized approach to cross-chain deployments, with the goal of supporting a multichain Uniswap ecosystem.\n\nMoonbeam is a Polkadot parachain which features EVM-compatibility, allowing it to serve as a port-of-entry for Ethereum-native apps to participate in the greater Polkadot ecosystem. Deploying on Moonbeam will expand the Uniswap community to include users of the Polkadot ecosystem, helping Uniswap on its journey to become a leading product in the multichain world.\n\nMoonbeam is a reputable chain which has enjoyed high stability and considerable activity since its launch in January, making it a great fit for Uniswap’s trusted brand.\n\n## About Moonbeam\n\nMoonbeam is an EVM-compatible smart contract parachain of the Polkadot network; it is optimized for cross-chain use cases and natively interoperable applications. EVM compatibility and a comprehensive tool suite of integrations like Etherscan, The Graph, Chainlink, and more, allow developers to deploy existing Solidity smart contracts and apps to Moonbeam with minimal changes. Moonbeam also extends the EVM with native cross-chain integrations powered by [Polkadot’s XCM](https://polkadot.network/blog/xcm-the-cross-consensus-message-format/), allowing Moonbeam apps to interact with assets and services from other chains in the Polkadot ecosystem in a trust-minimized way.\n\nMoonbeam was the first parachain to go live on the Polkadot network, launching on January 11 this year. Like Moonriver, its sister parachain on Kusama, Moonbeam is expected to accumulate developer and user activity from the [100+ projects](https://moonbeam.network/community/projects/) building DApps and protocols on the network.\n\n## Expanding Uniswap to Moonbeam\n\nWe believe that the timing is perfect for Uniswap V3 to deploy on Moonbeam. \n\nUniswap has been deployed on Ethereum, Polygon, Arbitrum, and Optimism, giving it great coverage within Ethereum and its most popular L2s. However, Uniswap has not yet expanded beyond the greater Ethereum ecosystem.\n\nUnlike the other deployment targets, Moonbeam represents a much larger target market — Polkadot users. The growth potential of the Polkadot ecosystem is reflected in part by the fact that Polkadot consistently ranks in the top ecosystems for developer activity, despite having just enabled parachains auctions in December 2021. The Polkadot community has grown in parallel with the Ethereum community, and shares many of the same values — decentralization, censorship resistance, open access to finance, to name a few. However, the two communities have largely been discrete, and deploying Uniswap on Moonbeam brings them together in a meaningful way.\n\nMoonbeam is the de facto DeFi hub for Polkadot. Blue chip DeFi projects have deployed or committed to deploying to Moonbeam, including Sushiswap, Lido, Curve, Chainlink and Covalent. As the ecosystem develops, we believe that deploying Uniswap V3 will position it to become a premier AMM on Moonbeam, and, more broadly, a large liquidity hub for the entire Polkadot ecosystem. This represents a massive opportunity to capture this untapped market, which could mean significant fee revenue for LPs and UNI token holders.\n\nThe Nomad team has worked on this proposal because [Nomad and Connext](https://medium.com/connext/connext-has-partnered-with-nomad-e20cd8e62e31) have already been deployed as Moonbeam’s main bridging solutions, and have begun to drive cross-chain liquidity from Ethereum into Moonbeam. By deploying Uniswap V3 on Moonbeam, Nomad would be able to route even more liquidity into Uniswap pools and additionally facilitate cross-chain communication for Uniswap governance.\n\n## Trust-Minimized Bridging and Cross-Chain Governance\n\nDecentralized cross-chain governance is a topic we are excited about working on within the Uniswap ecosystem. As Uniswap Labs highlighted in their post about [Multichain Uniswap](https://uniswap.org/blog/multichain-uniswap), it is important that new chains have a trust-minimized arbitrary message passing solution to facilitate secure, decentralized governance of a deployment of Uniswap. The Moonbeam community already uses [Nomad](https://docs.nomad.xyz/) and [Connext](https://www.connext.network/) to bridge ERC-20 tokens from Ethereum; despite Moonbeam having only been live for two months, $35M TVL is currently bridged to Moonbeam via Nomad, with over $250M in total volume since deployment. However, Nomad is more than just a protocol for token bridging; at its core, Nomad is a protocol for trust-minimized arbitrary message passing, and Uniswap V3 deployed on Moonbeam can leverage Nomad for governance.\n\nWe have worked with developers at Uniswap Labs to research, understand, and document the current state of [cross-chain governance for Uniswap](https://docs.google.com/document/d/1CQWXCXdA5to7RKfVPozI8vEcw_QJrRQMP9HiQ8nbOu0/edit#heading=h.708hyjg41wlu) deployments. It became clear that, currently, cross-chain governance solutions have been patched together differently for all three of the chains that Uniswap is deployed on, leading to significant complexity and overhead for governance participants who wish to execute proposals governing deployments on other chains. This problem will multiply as Uniswap is deployed to more chains.\n\nNomad can provide an out-of-the-box solution for this problem. Nomad’s own contracts are governed by a decentralized cross-chain [governance app](https://github.com/nomad-xyz/monorepo/blob/main/packages/contracts-core/contracts/governance/GovernanceRouter.sol) built on its arbitrary message passing rails. This application can be [tailored](https://github.com/nomad-xyz/monorepo/pull/95) for the purpose of governing Uniswap deployments on chains other than Ethereum mainnet. Rather than attempting to introduce this change on all chains at once, however, we can demonstrate the value of this solution in a de-risked manner by leveraging it first for a new deployment, Moonbeam.\n\n\n## Rewards and Grants\n\nAs part of this proposal, Nomad, via a grant from the Moonbeam Foundation, will commit $2,500,000 to the Uniswap Grants Program to help grow the Multichain Uniswap ecosystem.\n\nThrough collaborative discussions with members of the Uniswap community, we learned that there were likely higher-leverage ways to enrich the Uniswap community than just providing liquidity mining rewards. As Uniswap develops into a multi-chain ecosystem, we want to support developers working to create high-quality multichain apps building on-top of Uniswap, and better multichain experiences for Uniswap users. These grants will promote long-term protocol development, developer activity and innovation towards this goal.\n\nTo borrow language from the [Uniswap Grants + Gitcoin](https://gitcoin.co/blog/case-study-uniswap-grants/#:~:text=Uniswap%20Grants%20gained%20access%20to,Gitcoin%20was%20founded%20in%202017) announcement, we hope for this initiative to fund “bounties, hackathons, and grants” for “developers, designers, community organizers and other web3 builders” working on multi-chain projects which improve, extend, promote or build upon Unsiwap in a cross-chain manner.\n\n\nExamples of projects that could be funded with this grant include: \n- Building a cross-chain application which allows Uniswap LPs to close a position on Ethereum and open one atomically on Moonbeam\n- Improving open-source wallet softwares to create better multi-chain user experiences for Uniswap users\n- Building a frontend application which allows governance participants to more easily construct cross-chain governance proposals for Uniswap\n- Leveraging Substrate’s native interoperability protocol, XCM, to build an application which composes Uniswap on Moonbeam with another substrate chain\nFunding office hours to educate new users about multichain crypto experiences\n\nWe are so excited to see what members of the Uniswap community come up with to leverage this grant!\n\n## Conclusion\n\nWe are excited about the possibility of the Uniswap community entering the Polkadot ecosystem via a V3 deployment on Moonbeam. To reiterate, we feel that this is a fantastic opportunity for the following reasons:\n\n- **Expansion into Polkadot**: Uniswap will be able to tap into a brand new market and all the community members in the Polkadot ecosystem. Moonbeam’s EVM-compatibility makes it simple to deploy existing Solidity code, while simultaneously providing access to other parachains using XCM. By leveraging XCM and Moonbeam’s position as the DeFi hub for Polkadot, Uniswap has the opportunity to become the premier AMM across Polkadot. \n- **Trust-minimized Governance**: Per Uniswap’s goal of becoming a multi-chain protocol while remaining trust-minimized, we propose using Nomad’s trust-minimized channels to deploy Uniswap V3 on Moonbeam. This can serve as an opportunity to test this improved decentralized governance application within a safe container, with the potential of rolling it out to other V3 deployments in the future.\n- **Rewards for Uniswap Grants Program**: Instead of simply offering liquidity mining incentives, we want to fund community members working to develop and enrich multichain experiences built with Uniswap. We will commit $2.5M to the Uniswap Grants Program to fund cross-chain development deployed within the Uniswap ecosystem, in order to further expand Uniswap’s multi-chain presence.\n\nWe are excited to engage with the Uniswap community and governance process to discuss more around bringing Uniswap V3 to Moonbeam. Please let us know any and all feedback and criticism, so that we can improve this proposal and expand Uniswap into Moonbeam and Polkadot!",
        "choices": [
          "Yes",
          "No"
        ],
        "start": 1649111339,
        "end": 1649370539,
        "snapshot": "14522157",
        "state": "closed",
        "author": "0x7AE109A63ff4DC852e063a673b40BED85D22E585",
        "scores": [
          9636742.915859276,
          399.21
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      },
      {
        "id": "QmaG6nJYW3xLeQwAa6xxhpbuYS8h6PVQpbx1vfqpqxAtik",
        "title": "[Temperature Check] Deploy Uniswap V3 on Moonbeam",
        "body": "## Proposal Discussion Topic\n\n[Blockchain at Berkeley](https://blockchain.berkeley.edu) is creating this proposal in partnership with [Nomad](https://www.docs.nomad.xyz/) to Deploy Uniswap V3 on Moonbeam.\n\n## Summary\n\nIn support of furthering the vision of [Multichain Uniswap](https://uniswap.org/blog/multichain-uniswap), we propose that the Uniswap community vote to authorize the deployment of Uniswap V3 to Moonbeam. We hope this proposal will serve as an example to create a generalizable, trust-minimized approach to cross-chain deployments, with the goal of supporting a multichain Uniswap ecosystem.\n\nMoonbeam is a Polkadot parachain which features EVM-compatibility, allowing it to serve as a port-of-entry for Ethereum-native apps to participate in the greater Polkadot ecosystem. Deploying on Moonbeam will expand the Uniswap community to include users of the Polkadot ecosystem, helping Uniswap on its journey to become a leading product in the multichain world.\n\nMoonbeam is a reputable chain which has enjoyed high stability and considerable activity since its launch in January, making it a great fit for Uniswap’s trusted brand.\n\n## About Moonbeam\n\nMoonbeam is an EVM-compatible smart contract parachain of the Polkadot network; it is optimized for cross-chain use cases and natively interoperable applications. EVM compatibility and a comprehensive tool suite of integrations like Etherscan, The Graph, Chainlink, and more, allow developers to deploy existing Solidity smart contracts and apps to Moonbeam with minimal changes. Moonbeam also extends the EVM with native cross-chain integrations powered by [Polkadot’s XCM](https://polkadot.network/blog/xcm-the-cross-consensus-message-format/), allowing Moonbeam apps to interact with assets and services from other chains in the Polkadot ecosystem in a trust-minimized way.\n\nMoonbeam was the first parachain to go live on the Polkadot network, launching on January 11 this year. Like Moonriver, its sister parachain on Kusama, Moonbeam is expected to accumulate developer and user activity from the [100+ projects](https://moonbeam.network/community/projects/) building DApps and protocols on the network.\n\n## Expanding Uniswap to Moonbeam\n\nWe believe that the timing is perfect for Uniswap V3 to deploy on Moonbeam. \n\nUniswap has been deployed on Ethereum, Polygon, Arbitrum, and Optimism, giving it great coverage within Ethereum and its most popular L2s. However, Uniswap has not yet expanded beyond the greater Ethereum ecosystem.\n\nUnlike the other deployment targets, Moonbeam represents a much larger target market — Polkadot users. The growth potential of the Polkadot ecosystem is reflected in part by the fact that Polkadot consistently ranks in the top ecosystems for developer activity, despite having just enabled parachains auctions in December 2021. The Polkadot community has grown in parallel with the Ethereum community, and shares many of the same values — decentralization, censorship resistance, open access to finance, to name a few. However, the two communities have largely been discrete, and deploying Uniswap on Moonbeam brings them together in a meaningful way.\n\nMoonbeam is the de facto DeFi hub for Polkadot. Blue chip DeFi projects have deployed or committed to deploying to Moonbeam, including Sushiswap, Lido, Curve, Chainlink and Covalent. As the ecosystem develops, we believe that deploying Uniswap V3 will position it to become a premier AMM on Moonbeam, and, more broadly, a large liquidity hub for the entire Polkadot ecosystem. This represents a massive opportunity to capture this untapped market, which could mean significant fee revenue for LPs and UNI token holders.\n\nThe Nomad team has worked on this proposal because [Nomad and Connext](https://medium.com/connext/connext-has-partnered-with-nomad-e20cd8e62e31) have already been deployed as Moonbeam’s main bridging solutions, and have begun to drive cross-chain liquidity from Ethereum into Moonbeam. By deploying Uniswap V3 on Moonbeam, Nomad would be able to route even more liquidity into Uniswap pools and additionally facilitate cross-chain communication for Uniswap governance.\n\n## Trust-Minimized Bridging and Cross-Chain Governance\n\nDecentralized cross-chain governance is a topic we are excited about working on within the Uniswap ecosystem. As Uniswap Labs highlighted in their post about [Multichain Uniswap](https://uniswap.org/blog/multichain-uniswap), it is important that new chains have a trust-minimized arbitrary message passing solution to facilitate secure, decentralized governance of a deployment of Uniswap. The Moonbeam community already uses [Nomad](https://docs.nomad.xyz/) and [Connext](https://www.connext.network/) to bridge ERC-20 tokens from Ethereum; despite Moonbeam having only been live for two months, $35M TVL is currently bridged to Moonbeam via Nomad, with over $250M in total volume since deployment. However, Nomad is more than just a protocol for token bridging; at its core, Nomad is a protocol for trust-minimized arbitrary message passing, and Uniswap V3 deployed on Moonbeam can leverage Nomad for governance.\n\nWe have worked with developers at Uniswap Labs to research, understand, and document the current state of [cross-chain governance for Uniswap](https://docs.google.com/document/d/1CQWXCXdA5to7RKfVPozI8vEcw_QJrRQMP9HiQ8nbOu0/edit#heading=h.708hyjg41wlu) deployments. It became clear that, currently, cross-chain governance solutions have been patched together differently for all three of the chains that Uniswap is deployed on, leading to significant complexity and overhead for governance participants who wish to execute proposals governing deployments on other chains. This problem will multiply as Uniswap is deployed to more chains.\n\nNomad can provide an out-of-the-box solution for this problem. Nomad’s own contracts are governed by a decentralized cross-chain [governance app](https://github.com/nomad-xyz/monorepo/blob/main/packages/contracts-core/contracts/governance/GovernanceRouter.sol) built on its arbitrary message passing rails. This application can be [tailored](https://github.com/nomad-xyz/monorepo/pull/95) for the purpose of governing Uniswap deployments on chains other than Ethereum mainnet. Rather than attempting to introduce this change on all chains at once, however, we can demonstrate the value of this solution in a de-risked manner by leveraging it first for a new deployment, Moonbeam.\n\n\n## Rewards and Grants\n\nAs part of this proposal, Nomad, via a grant from the Moonbeam Foundation, will commit $2,500,000 to the Uniswap Grants Program to help grow the Multichain Uniswap ecosystem.\n\nThrough collaborative discussions with members of the Uniswap community, we learned that there were likely higher-leverage ways to enrich the Uniswap community than just providing liquidity mining rewards. As Uniswap develops into a multi-chain ecosystem, we want to support developers working to create high-quality multichain apps building on-top of Uniswap, and better multichain experiences for Uniswap users. These grants will promote long-term protocol development, developer activity and innovation towards this goal.\n\nTo borrow language from the [Uniswap Grants + Gitcoin](https://gitcoin.co/blog/case-study-uniswap-grants/#:~:text=Uniswap%20Grants%20gained%20access%20to,Gitcoin%20was%20founded%20in%202017) announcement, we hope for this initiative to fund “bounties, hackathons, and grants” for “developers, designers, community organizers and other web3 builders” working on multi-chain projects which improve, extend, promote or build upon Unsiwap in a cross-chain manner.\n\n\nExamples of projects that could be funded with this grant include: \n- Building a cross-chain application which allows Uniswap LPs to close a position on Ethereum and open one atomically on Moonbeam\n- Improving open-source wallet softwares to create better multi-chain user experiences for Uniswap users\n- Building a frontend application which allows governance participants to more easily construct cross-chain governance proposals for Uniswap\n- Leveraging Substrate’s native interoperability protocol, XCM, to build an application which composes Uniswap on Moonbeam with another substrate chain\nFunding office hours to educate new users about multichain crypto experiences\n\nWe are so excited to see what members of the Uniswap community come up with to leverage this grant!\n\n## Conclusion\n\nWe are excited about the possibility of the Uniswap community entering the Polkadot ecosystem via a V3 deployment on Moonbeam. To reiterate, we feel that this is a fantastic opportunity for the following reasons:\n\n- **Expansion into Polkadot**: Uniswap will be able to tap into a brand new market and all the community members in the Polkadot ecosystem. Moonbeam’s EVM-compatibility makes it simple to deploy existing Solidity code, while simultaneously providing access to other parachains using XCM. By leveraging XCM and Moonbeam’s position as the DeFi hub for Polkadot, Uniswap has the opportunity to become the premier AMM across Polkadot. \n- **Trust-minimized Governance**: Per Uniswap’s goal of becoming a multi-chain protocol while remaining trust-minimized, we propose using Nomad’s trust-minimized channels to deploy Uniswap V3 on Moonbeam. This can serve as an opportunity to test this improved decentralized governance application within a safe container, with the potential of rolling it out to other V3 deployments in the future.\n- **Rewards for Uniswap Grants Program**: Instead of simply offering liquidity mining incentives, we want to fund community members working to develop and enrich multichain experiences built with Uniswap. We will commit $2.5M to the Uniswap Grants Program to fund cross-chain development deployed within the Uniswap ecosystem, in order to further expand Uniswap’s multi-chain presence.\n\nWe are excited to engage with the Uniswap community and governance process to discuss more around bringing Uniswap V3 to Moonbeam. Please let us know any and all feedback and criticism, so that we can improve this proposal and expand Uniswap into Moonbeam and Polkadot!",
        "choices": [
          "Yes",
          "No"
        ],
        "start": 1648681895,
        "end": 1648941095,
        "snapshot": "14490287",
        "state": "closed",
        "author": "0x7AE109A63ff4DC852e063a673b40BED85D22E585",
        "scores": [
          8326659.283348162,
          1016.1198322105358
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      },
      {
        "id": "0xb328c7583c0f1ea85f8a273dd36977c95e47c3713744caf7143e68b65efcc8a5",
        "title": "Temperature Check - Should Uniswap v3 be deployed to Gnosis Chain?",
        "body": "\n#### Deploy Uni V3 to Gnosis Chain\n\nIn production since 2018 (as the xDai Chain), the rebranded Gnosis Chain is rapidly evolving with a new focus and mission. Gnosis Chain (GC) provides a real-world value chain that closely mirrors the Ethereum 2.0 ecosystem. This includes a beacon chain framework, rollups, and other vital functionality. GC will serve in a front-running capacity for important Ethereum 2.0 updates,\n\nTuned parameters on the Gnosis Chain enable faster blocks and epochs, low-cost stable transactions, and the opportunity to construct trustless bridges and conduct seamless transfers between GC and the Ethereum 2.0 mainnet.\n\nThe Gnosis Chain team is committed to ecosystem development, adoption, and growth as the Eth2.0 landscape comes into focus. With a mission to “accelerate Ethereum,” Gnosis Chain is poised for expansion. With this in mind, we propose a Uniswap v3 deployment to the Gnosis Chain. We believe there are many benefits for both Uniswap Labs and Uniswap users, some of which include:\n\n1. **A DeFi ecosystem primed for growth.** Once deployed, Uniswap would become a cornerstone DeFi engine for protocols using and interacting within the ecosystem. Perpetual Protocol is a flagship protocol on GC that relies on Uniswap v3. This deployment will enable Perpetual to continue to flourish on the Gnosis Chain. Additional bluechip deployments with growing TVL include Curve, Sushiswap, and Tornado, with many new and promising DeFi projects choosing Gnosis Chain as their homebase. A list of current projects is available at https://gnosischain.world/\n\n\n2. **An iterative environment.** Uniswap Labs can experiment with new functionality and front-run new features in a real-value environment (which differs from a test environment in that users behave differently with value on the line, token supply is limited, real adversaries exist, etc). Uniswap can spot and remediate any final potential issues stemming from important Ethereum updates prior to mainnet activation and take advantage of optimized slot and epoch times for faster iteration.\n\n\n3. **Tight Ethereum compatibility.** Tools, resources, projects, and protocols supported by Ethereum are already supported by the Gnosis Chain, with more onboarding regularly. Gnosis Safe is facilitating daily operations for many existing projects. A trustless bridge architecture designed to connect Ethereum and Gnosis Chain is in the works. The Gnosis Beacon Chain validator set is expanding rapidly bringing massive decentralization to the chain.\n\nThe primary differences separating the GBC from the Ethereum Beacon chain include 5-second blocks and < 2-minute epochs, stable transactions with a max target of $.01 per 100K gas, an economically and geographically diverse validator set, and a lower-stakes, lower-TVL environment.\n\n\nUnique chain characteristics. Stable, low-cost transactions provide unique opportunities for Uniswap users. When gas costs are known and have a low impact on trade decisions, new strategies and approaches emerge which are currently untenable on the Ethereum mainnet or other chains with wide-ranging fee variability.\n\n\nUser incentives. A large directive for the Gnosis Chain is to increase the user base and on-chain activity by strategically allocating funds from the GnosisDAO treasury to promote adoption. An ecosystem fund has been created for this purpose, and we propose to use a portion of these funds to promote Uniswap v3 on Gnosis Chain.  We propose providing up to $10M for a tailored liquidity mining program.\nThe Gnosis Chain is preparing for substantial growth in the coming year. We have implemented an aggressive infrastructure grants program including large grants to Nethermind, Lighthouse and Erigon client teams to support base-layer functionality and security. The ecosystem fund will bring in many new projects, and we feel Uniswap v3 is an essential component that will serve as a foundational layer for this growth. \n\nWe welcome any questions and comments and are happy to provide any clarifications as needed. We are excited to submit this proposal to the Uniswap community and look forward to your feedback! Thank you.\n",
        "choices": [
          "Yes",
          "No"
        ],
        "start": 1647954986,
        "end": 1648214186,
        "snapshot": "14436239",
        "state": "closed",
        "author": "0x6d9ABa400a2a487a5Fb76c6d56518835553CD284",
        "scores": [
          7015853.747219704,
          45.63992196668504
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      },
      {
        "id": "QmZ2D27uouvVEHGuRvydwmwepgL2PEXbGzYAXqYr9bMwLo",
        "title": "Consensus Check - Should Uniswap add the 1bp fee tier to Polygon?",
        "body": "# Summary\n\nTo date, Uniswap has four deployments: Ethereum, Abritrum, Optimism, and Polygon. In addition to these deployments, there are proposals to deploy Uniswap on Harmony, Celo, and more chains expected soon. The protocol should continue to deploy to new markets, but as the protocol continues to grow, it is vital the protocol learns to manage each of the deployments. With each new chain, there is new infrastructure that needs to be adapted to so that UNI on Ethereum can govern all of these deployments.\n\nGFX Labs has been researching the various deployments and has prepared the first Uniswap cross-chain proposal to demonstrate how mainnet UNI can manage deployments on other chains.\n\nPolygon has a messaging mechanism between Ethereum and Polygon called the [Fx-Portal](https://docs.polygon.technology/docs/develop/l1-l2-communication/fx-portal/). The portal functions via three contracts: FxRoot, State Sender, & FxChild. Messages can be sent from Ethereum to Polygon by calling the sendMessageToChild(address, bytes) at the FxRoot contract on Ethereum, which calls the State Sender contract. The [validators](https://docs.polygon.technology/docs/validate/polygon-basics/who-is-validator/) monitor the State Sender contract and relay messages to the FxChild on Polygon. Upon successful relay to the FxChild, the message is executed on Polygon by the validators.\n\nThe owner of the Uniswap v3 contracts on Polygon is the [Ethereum Proxy contract](https://polygonscan.com/address/0x8a1b966ac46f42275860f905dbc75efbfdc12374#code). The proxy contract will only process transactions that originate from the [Timelock contract](https://etherscan.io/address/0x1a9c8182c09f50c8318d769245bea52c32be35bc#code) on Ethereum and are delivered by the [FxChild](https://polygonscan.com/address/0x8397259c983751daf40400790063935a11afa28a). Every governance proposal targeting a change on Polygon should set the [FxRoot](https://etherscan.io/address/0xfe5e5d361b2ad62c541bab87c45a0b9b018389a2#code) on Ethereum as the target and send the message (parameter change) via the contract. The message passed through the FxRoot must contain the target(s) contract on Polygon, the function(s) to call, the call data(s), similar to the proposal system.\n\nFor the pilot of cross-chain governance, we are implementing the 1 basis point/1 tick fee tier on Polygon. The 1bp pools on Ethereum have been incredibly successful and increased Uniswap’s market share significantly since GFX Labs’ successful proposal in November 2021.\n\n[![|624x281](https://lh5.googleusercontent.com/nkHPN-akEVdPkIr3P7Tya8wvZMBftJryqVfsnwKaSp5mowgmcCq_aYEPkvKdIW8I20tPa6clkSUrCA78yTtebtf6iYfsgqHYt9x1Fg4lZaRhCgkvO2rbszg2wB1aJsWcIxLgHbLU)](https://dune.xyz/queries/150801)\n\nBecause governance has already approved it on Ethereum, the content of this proposal should not be controversial and puts the focus on the research and implementation.\n\n# Proposal\n\nGFX Labs has already tested the governance proposal on Goerli & Mumbai.\n\nTo build the proposal–[Uniswap Governor Alpha](https://goerli.etherscan.io/address/0x5e4be8bc9637f0eaa1a755019e06a68ce081d58f#writeContract): propose()\n\n1. Targets: [[FxRoot Contract](https://goerli.etherscan.io/address/0x3d1d3e34f7fb6d26245e6640e1c50710efff15ba#writeContract)]\n2. Values: [0]\n3. Signatures: [“”]\n4. Call data: [Call data to be processed by the FxRoot]. The data is from the sendMessageToChild(_receiver (address), _data (bytes))\n\n```\n    _receiver (address) is the [EthereumProxy contract](https://mumbai.polygonscan.com/address/0x8a1b966ac46f42275860f905dbc75efbfdc12374#code) which is the owner of the [Uniswap Factory contract on Polyon](https://mumbai.polygonscan.com/address/0x1f98431c8ad98523631ae4a59f267346ea31f984).\n    _data (bytes) is an encoded message where the abi is address[] targets, bytes[] datas, uint256[] values\n\n      1. Targets: [[Uniswap Factory contract on Polygon](https://mumbai.polygonscan.com/address/0x1f98431c8ad98523631ae4a59f267346ea31f984)]\n      2. Datas: [Uniswap Factory contract–enableFeeAmount(100,1)]\n      3. Values: [0]\n```\n\n5. Description: “1bp polygon test”\n\n# Successful test\n\n1. [Proposal](https://goerli.etherscan.io/tx/0xa201faffc23069f80dca9c8956eec9a8091b896454468b9c3ea9b44dbd436370#eventlog)\n2. [Vote](https://goerli.etherscan.io/tx/0x4e53072c73ddd09000304235bb8201b7ed7e866c7d7e5b2fa8c4c95ad4ac09df#eventlog)\n3. [Queue](https://goerli.etherscan.io/tx/0xa24ec65a9f333566b27d23bf962a9de55026e5a131940461a2a9a668ce90a062#eventlog)\n4. [Execute (Mainnet)](https://goerli.etherscan.io/tx/0x2bd39e01e411bcea42c9f439f9b6671bfe15fecf73961e564828f5979d722c92#eventlog)\n5. [Executed (Polyon)](https://mumbai.polygonscan.com/tx/0xa822e4df25425aa30dc061b80eb9728ca09e23f254c983ce3e127a0a44e0b7ae#eventlog)\n\n[Temperature Check Snapshot](https://snapshot.org/#/uniswap/proposal/QmWhemJom3RZdH91rBPmjvAFZEr9HdFRSFVNtAae6kgbyE): 3/18/2022-3/21/2022\nConsensus Check Snapshot: 3/21/2022-3/26/2022\n\nGovernance Proposal ETA: 3/28/2022",
        "choices": [
          "Yes",
          "No"
        ],
        "start": 1647900720,
        "end": 1648332000,
        "snapshot": "14432297",
        "state": "closed",
        "author": "0xa6e8772af29b29B9202a073f8E36f447689BEef6",
        "scores": [
          9030382.898244249,
          16.471676707156778
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      },
      {
        "id": "QmWhemJom3RZdH91rBPmjvAFZEr9HdFRSFVNtAae6kgbyE",
        "title": "Temp Check - Should Uniswap add the 1bp fee tier to Polygon?",
        "body": "\n# Summary\n\nTo date, Uniswap has four deployments: Ethereum, Abritrum, Optimism, and Polygon. In addition to these deployments, there are proposals to deploy Uniswap on Harmony, Celo, and more chains expected soon. The protocol should continue to deploy to new markets, but as the protocol continues to grow, it is vital the protocol learns to manage each of the deployments. With each new chain, there is new infrastructure that needs to be adapted to so that UNI on Ethereum can govern all of these deployments.\n\nGFX Labs has been researching the various deployments and has prepared the first Uniswap cross-chain proposal to demonstrate how mainnet UNI can manage deployments on other chains.\n\nPolygon has a messaging mechanism between Ethereum and Polygon called the [Fx-Portal](https://docs.polygon.technology/docs/develop/l1-l2-communication/fx-portal/). The portal functions via three contracts: FxRoot, State Sender, & FxChild. Messages can be sent from Ethereum to Polygon by calling the sendMessageToChild(address, bytes) at the FxRoot contract on Ethereum, which calls the State Sender contract. The [validators](https://docs.polygon.technology/docs/validate/polygon-basics/who-is-validator/) monitor the State Sender contract and relay messages to the FxChild on Polygon. Upon successful relay to the FxChild, the message is executed on Polygon by the validators.\n\nThe owner of the Uniswap v3 contracts on Polygon is the [Ethereum Proxy contract](https://polygonscan.com/address/0x8a1b966ac46f42275860f905dbc75efbfdc12374#code). The proxy contract will only process transactions that originate from the [Timelock contract](https://etherscan.io/address/0x1a9c8182c09f50c8318d769245bea52c32be35bc#code) on Ethereum and are delivered by the [FxChild](https://polygonscan.com/address/0x8397259c983751daf40400790063935a11afa28a). Every governance proposal targeting a change on Polygon should set the [FxRoot](https://etherscan.io/address/0xfe5e5d361b2ad62c541bab87c45a0b9b018389a2#code) on Ethereum as the target and send the message (parameter change) via the contract. The message passed through the FxRoot must contain the target(s) contract on Polygon, the function(s) to call, the call data(s), similar to the proposal system.\n\nFor the pilot of cross-chain governance, we are implementing the 1 basis point/1 tick fee tier on Polygon. The 1bp pools on Ethereum have been incredibly successful and increased Uniswap’s market share significantly since GFX Labs’ successful proposal in November 2021.\n\n[![|624x281](https://lh5.googleusercontent.com/nkHPN-akEVdPkIr3P7Tya8wvZMBftJryqVfsnwKaSp5mowgmcCq_aYEPkvKdIW8I20tPa6clkSUrCA78yTtebtf6iYfsgqHYt9x1Fg4lZaRhCgkvO2rbszg2wB1aJsWcIxLgHbLU)](https://dune.xyz/queries/150801)\n\nBecause governance has already approved it on Ethereum, the content of this proposal should not be controversial and puts the focus on the research and implementation.\n\n# Proposal\n\nGFX Labs has already tested the governance proposal on Goerli & Mumbai.\n\nTo build the proposal–[Uniswap Governor Alpha](https://goerli.etherscan.io/address/0x5e4be8bc9637f0eaa1a755019e06a68ce081d58f#writeContract): propose()\n\n1. Targets: [[FxRoot Contract](https://goerli.etherscan.io/address/0x3d1d3e34f7fb6d26245e6640e1c50710efff15ba#writeContract)]\n2. Values: [0]\n3. Signatures: [“”]\n4. Call data: [Call data to be processed by the FxRoot]\n\n  1. Data is from the sendMessageToChild(_receiver (address), _data (bytes))\n\n    _receiver (address) is the [EthereumProxy contract](https://mumbai.polygonscan.com/address/0x8a1b966ac46f42275860f905dbc75efbfdc12374#code) which is the owner of the [Uniswap Factory contract on Polyon](https://mumbai.polygonscan.com/address/0x1f98431c8ad98523631ae4a59f267346ea31f984).\n    _data (bytes) is an encoded message where the abi is address[] targets, bytes[] datas, uint256[] values\n\n      1. Targets: [[Uniswap Factory contract on Polygon](https://mumbai.polygonscan.com/address/0x1f98431c8ad98523631ae4a59f267346ea31f984)]\n      2. Datas: [Uniswap Factory contract–enableFeeAmount(100,1)]\n      3. Values: [0]\n\n5. Description: “1bp polygon test”\n\n# Successful test\n\n1. [Proposal](https://goerli.etherscan.io/tx/0xa201faffc23069f80dca9c8956eec9a8091b896454468b9c3ea9b44dbd436370#eventlog)\n2. [Vote](https://goerli.etherscan.io/tx/0x4e53072c73ddd09000304235bb8201b7ed7e866c7d7e5b2fa8c4c95ad4ac09df#eventlog)\n3. [Queue](https://goerli.etherscan.io/tx/0xa24ec65a9f333566b27d23bf962a9de55026e5a131940461a2a9a668ce90a062#eventlog)\n4. [Execute (Mainnet)](https://goerli.etherscan.io/tx/0x2bd39e01e411bcea42c9f439f9b6671bfe15fecf73961e564828f5979d722c92#eventlog)\n5. [Executed (Polyon)](https://mumbai.polygonscan.com/tx/0xa822e4df25425aa30dc061b80eb9728ca09e23f254c983ce3e127a0a44e0b7ae#eventlog)\n\nTemperature Check Snapshot: 3/18/2022-3/20/2022\nConsensus Check Snapshot: 3/20/2022-3/25/2022\n\nGovernance Proposal ETA: 3/28/2022",
        "choices": [
          "Yes",
          "No"
        ],
        "start": 1647639463,
        "end": 1647900000,
        "snapshot": "14412875",
        "state": "closed",
        "author": "0xa6e8772af29b29B9202a073f8E36f447689BEef6",
        "scores": [
          8930622.307123052,
          403.3
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      },
      {
        "id": "0xa5b0e54358d8a0bff4b90461873cd4bec83e57d7b87f2e18b9a4ff81539b21ca",
        "title": "[Consensus Check] Should we deploy Uniswap V3 on Celo?",
        "body": "### Summary:\n\nDear Uniswap community,\n\nAbout a week ago we (the Blockchain at Michigan in partnership with the [Celo Foundation](https://celo.org/) and the [Celo Climate Collective](https://climatecollective.org/)) submitted a proposal to deploy Uniswap V3 on Celo to launch “Green Asset” Liquidity Pools and expand access to Uniswap to the 6B smartphone users around the world.\n\nWe initiated the [Temperature Check](https://snapshot.org/#/uniswap/proposal/0x4fdc5d5c87669d3c99072541e1c775f8dee9b906241b2ce22203737b608c8e55) on Snapshot, where the proposal received strong support from the Uniswap community. 12M UNI (~100%) voted yes for the proposal.\n\nWe’re excited to initiate the Consensus Check phase. We’d love to receive your support in this proposal.\n\nNOTE: Based on community feedback we’re also adding the following items to provide more information on a few items:\n\n* Approximately one-third of the $10M of financial incentives to Uniswap users for green asset pools will be placed in a multisig with the Celo Foundation and 2-4 key members of the Uniswap community, including both individuals and institutions. This is to serve as a good faith deposit and demonstrate the Celo Foundation’s commitment to the Uniswap community, while also ensuring financial flexibility for the Celo Foundation. In the past, the Celo Foundation has ensured that promised rewards have been paid out (e.g. Sushi) and the plan is to continue doing so.\n* Uniswap V3 will be deployed on Celo by the Celo community through the “[Deploy Uniswap V3 Script](https://github.com/Uniswap/deploy-v3#deploy-uniswap-v3-script).” contingent upon approval by the Uniswap community via an Additional Use Grant (license change enacted via the ENS domain uniswap.eth).\n* Governance at deployment will be facilitated by messaging bridge [Optics](https://docs.celo.org/celo-codebase/protocol/optics)\n* Robert Leifke and Kyle Scott, members of Blockchain at Michigan, are co-founders of Mobius, a Celo stableswap protocol. To avoid any conflicts of interest, they have had no involvement in this partnership between Blockchain at Michigan and the Celo Foundation.\n\n[Temperature check discussion](https://gov.uniswap.org/t/temperature-check-uniswap-x-celo-green-pool-for-treasury-proposal/16428/4)\n\n### Updated Proposal discussion Topic:\n\nDeploy Uniswap V3 on Celo to Launch “Green Asset” Liquidity Pools and expand access to Uniswap to the 6B smartphone users around the world\n\n### Description:\n\nIn partnership with the Celo Foundation and the [Celo Climate Collective](https://climatecollective.org/), we propose to authorize the deployment of the Uniswap protocol to Celo on behalf of the community.\n\nCelo is a mobile-first, carbon-negative, EVM-compatible blockchain. Specifically, we propose launching Uniswap on the Celo platform to:\n\n* Increase Uniswap’s influence through $10M in financial incentives to Uniswap users, as well as additional grant funding provided by the Celo Foundation to utilize Uniswap as a financial building block\n* Bring Uniswap V3’s increased capital efficiency to the 6B smartphone users around the world\n* Create green asset liquidity pools with natural capital backed assets such as tokenized carbon credits (e.g. MCO2 and TCO2) and future nature backed assets issued on Celo like land and forests\n* Use Uniswap as a decentralized mechanism to rebalance the Celo Reserve with nature backed assets rather than relying on centralized exchanges\n* Foster pathways for future green use cases on Uniswap\n\nOverall, we believe the Uniswap community’s mission of creating a trustless and decentralized financial infrastructure accessible to anyone aligns with Celo’s vision of tackling climate change and achieving prosperity for all.\n\n### About Celo:\n\nCelo’s mission is to build an open financial system that creates the conditions of prosperity for all. To execute this mission, Celo’s technology features include:\n\n* A mobile-first EVM-compatible layer 1 blockchain that is accessible to anyone with a smartphone\n* Carbon negative by allocating 0.1% of epoch rewards to offset carbon—to date, [2,942](https://www.wren.co/profile/celo) tons of carbon has been offset, [which is over 8 times Celo’s carbon footprint](https://medium.com/celoorg/a-carbon-negative-blockchain-its-here-and-it-s-celo-60228de36490)\n* Algorithmic Celo stablecoins (currently cUSD, cEUR, and cREAL) with a smart-contract based expansion and contraction platform called Mento\n* An overcollateralized basket of crypto assets called the [Celo reserve](https://celoreserve.org/), currently made up of CELO, the network’s native asset, as well as BTC, ETH, DAI, and MCO2\n\nCelo is one of the fastest growing DeFi ecosystems with 2.6[M addresses, up to 1.1M daily transactions, and over 103M transactions](https://thecelo.com/). Additionally, Celo [has been chosen by Kickstarter](https://www.coindesk.com/business/2021/12/08/kickstarter-to-start-blockchain-based-crowdfunding-project-report/) for its upcoming decentralized product (to date, Kickstarter has successfully supported over[ 214,000 projects with over $6B in funding and 20M backers](https://www.kickstarter.com/help/stats)) which will attract new users to the ecosystem\n\nThe Celo Reserve includes almost $1M of MCO2 tokens, and Celo community members have proposed to add more natural capital assets moving forward as part of the [Climate Collective](https://climatecollective.org/). By including more natural capital assets, the Celo community has the vision of creating natural capital backed currencies. If, as a society, we were to denominate our economic activity in natural capital backed currencies, any economic growth—increase in money circulation—would lead to a growth in preserved natural resources. Celo aims to be the layer 1 blockchain for natural capital assets, and Uniswap can be the natural capital DEX for these assets on Celo.\n\n### Proposal\n\nBlockchain technology can help address limit greenhouse gas emissions and promote sustainable practices by tokenizing carbon-sequestering assets such as rainforests. Those tokenized assets can then be purchased by individuals and businesses to democratize carbon offsetting and increase funding for environmental protection projects. We believe that together, Uniswap and Celo can lead the path to growing natural capital assets.\n\nUniswap on the Celo platform will:\n\n* Allow for the launch of green asset liquidity pools: With the launch of the [Climate Collective](https://climatecollective.org/), Celo community members proposed to allocate up to 40% of the reserve over time towards natural capital backed assets. A natural capital backed asset (also known as “green” or “regenerative finance” asset) is a tokenized representation of natural assets in the “real” world. An example of a green asset is a non-fungible carbon-negative initiative quantified in terms of fungible CO2 sequestered (e.g. tokenized carbon credits).\n* Advance the use of natural capital backed currencies: The Celo Reserve grows as demand for Celo stable currencies grows. And as the reserve grows, so does the allocation towards green assets. This creates a feedback mechanism: with increased adoption of Celo stable currencies the reserve programmatically generates demand for additional green assets, preserving rainforests, and other carbon-sequestering assets.\n* Use Uniswap as a decentralized mechanism to rebalance the reserve: The Celo reserve will not only need to rebalance its BTC, ETH, etc. holdings but also a variety of natural capital backed assets, such as tokenized land, forests, and carbon credits. If approved by Celo’s community governance, a 40% allocation at current reserve values would correspond to natural capital assets worth 200M USD held by the reserve alone, requiring an efficient and liquid trading counterpart. Currently, the reserve rebalances via centralized exchanges. Green assets are not held by centralized exchanges, and so a decentralized exchange is needed in order to rebalance the Celo reserve as demand for stable currencies increases.\n* Increase capital efficiency: Uniswap v3’s concentrated liquidity mechanism will be especially important for Celo’s stablecoins that trade within a small price range.\n* Create pathways for future green use cases: Market participants are actively exploring other use cases on Celo. A list of current projects is available on https://climatecollective.org/.\n\nThe Celo Foundation will commit $10M of CELO in Uniswap-specific user incentives & grants on Celo. The Celo Foundation has successfully delivered committed rewards in the past (e.g. Sushi) and intends to do so in this instance as well. As a good faith deposit, approximately one-third of the $10M of financial incentives to Uniswap users for green asset pools will be placed in a multisig with the Celo Foundation and 2-4 key members of the Uniswap community, including both individuals and institutions. The $10M of financial incentives to Uniswap users for green asset pools will be placed in a multisig with the Celo Foundation and 2-4 key and active members of the Uniswap community including both individuals and institutions. In addition to the $10M in financial incentives for Uniswap specifically, the Celo Foundation will also focus on broader adoption of natural capital backed currencies and link this to ongoing efforts to making DeFi and crypto more accessible to the 6B smartphone users around the world through the following:\n\n* Promote the development of a mobile-first ecosystem through developer programs such as hackathons with Uniswap as a financial building block\n\n* Lead pilots and users research to help make Uniswap more accessible, especially in markets that lack access to basic financial tools and services.\n* Co-grant program to support projects that are launching and driving the growth of “green assets”\n\nUniswap V3 will be deployed on Celo by cLabs through the “[Deploy Uniswap V3 Script](https://github.com/Uniswap/deploy-v3#deploy-uniswap-v3-script).” contingent upon approval by the Uniswap community via an Additional Use Grant (license change enacted via the ENS domain uniswap.eth). Governance at deployment will be facilitated by the messaging bridge [Optics](https://docs.celo.org/celo-codebase/protocol/optics).\n\nWe propose a transparent measurement of this project's success through the following success criteria and long-term goals:\n\n* % of Celo Reserve allocated to green assets: 40% of the Celo Reserve (at current Celo Reserve levels this would correspond to $200M USD in green assets)\n* $ total TVL and TVL of associated green assets: 10x of Celo Reserve green asset holdings in circulation as LP\n* Impact of green assets in Celo Reserve: 17M tons of CO2 avoided or removed from the atmosphere (assuming an average price of $12 per ton and current Celo Reserve levels) , including all associated benefits (e.g. increase in biodiversity through protection of forests). This corresponds roughly to the annual absorption capacity of 1.7M hectares of forest area, or roughly the amount of [forest area lost in Brazil in 2020](https://www.globalforestwatch.org/blog/data-and-research/global-tree-cover-loss-data-2020/).\n\n### Conclusion\n\nCelo and Uniswap together can serve as the foundation for the proliferation of natural capital assets across Web3. We believe that the vision to advance climate and regenerative finance on Celo aligns with the Uniswap community. Thank you for your consideration and we welcome questions and suggestions.\n\n[Temperature check discussion](https://gov.uniswap.org/t/temperature-check-uniswap-x-celo-green-pool-for-treasury-proposal/16428/4)\n[Temperature check snapshot](https://snapshot.org/#/uniswap/proposal/0x4fdc5d5c87669d3c99072541e1c775f8dee9b906241b2ce22203737b608c8e55)",
        "choices": [
          "Yes",
          "No"
        ],
        "start": 1647304200,
        "end": 1647736200,
        "snapshot": "14387057",
        "state": "closed",
        "author": "0x13BDaE8c5F0fC40231F0E6A4ad70196F59138548",
        "scores": [
          7511223.797628663,
          8262.06978909871
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      },
      {
        "id": "0x4fdc5d5c87669d3c99072541e1c775f8dee9b906241b2ce22203737b608c8e55",
        "title": "Should we deploy Uniswap V3 on Celo?",
        "body": "### Proposal Discussion Topic\n\nThis proposal is created on behalf of Blockchain at Michigan, and in partnership with the [Celo Foundation](https://celo.org/) and the [Celo Climate Collective](https://climatecollective.org/).\nDeploy Uniswap V3 on Celo to Launch “Green Asset” Liquidity Pools and expand access to Uniswap to the 6B smartphone users around the world\n\n### Description\nWe propose to authorize the deployment of the Uniswap protocol to Celo on behalf of the community.\n\nCelo is a mobile-first, carbon-negative, EVM-compatible blockchain. Specifically, we propose launching Uniswap on the Celo platform to:\n\n* Increase Uniswap’s influence through $10M in financial incentives to Uniswap users, as well as additional grant funding provided by the Celo Foundation to utilize Uniswap as a financial building block\n* Bring Uniswap V3’s increased capital efficiency to the 6B smartphone users around the world\n* Create green asset liquidity pools with natural capital backed assets such as tokenized carbon credits (e.g. MCO2 and TCO2) and future nature backed assets issued on Celo like land and forests\n* Use Uniswap as a decentralized mechanism to rebalance the Celo Reserve with nature backed assets rather than relying on centralized exchanges\n* Foster pathways for future green use cases on Uniswap\n\nOverall, we believe the Uniswap community’s mission of creating a trustless and decentralized financial infrastructure accessible to anyone aligns with Celo’s vision of tackling climate change and achieving prosperity for all.\n\n### About Celo\n\nCelo’s mission is to build an open financial system that creates the conditions of prosperity for all. To execute this mission, Celo’s technology features include:\n\n* A mobile-first EVM-compatible layer 1 blockchain that is accessible to anyone with a smartphone\n* Carbon negative by allocating 0.1% of epoch rewards to offset carbon—to date, [2,942](https://www.wren.co/profile/celo) tons of carbon has been offset, [which is over 8 times Celo’s carbon footprint](https://medium.com/celoorg/a-carbon-negative-blockchain-its-here-and-it-s-celo-60228de36490)\n* Algorithmic Celo stablecoins (currently cUSD, cEUR, and cREAL) with a smart-contract based expansion and contraction platform called Mento\n* An overcollateralized basket of crypto assets called the [Celo reserve](https://celoreserve.org/), currently made up of CELO, the network’s native asset, as well as BTC, ETH, DAI, and MCO2\n\nCelo is one of the fastest growing DeFi ecosystems with 2.6[M addresses, up to 1.1M daily transactions, and over 103M transactions](https://thecelo.com/). Additionally, Celo [has been chosen by Kickstarter](https://www.coindesk.com/business/2021/12/08/kickstarter-to-start-blockchain-based-crowdfunding-project-report/) for its upcoming decentralized product (to date, Kickstarter has successfully supported over[ 214,000 projects with over $6B in funding and 20M backers](https://www.kickstarter.com/help/stats)) which will attract new users to the ecosystem\n\nThe Celo Reserve includes almost $1M of MCO2 tokens, and Celo community members have proposed to add more natural capital assets moving forward as part of the [Climate Collective](https://climatecollective.org/). By including more natural capital assets, the Celo community has the vision of creating natural capital backed currencies. If, as a society, we were to denominate our economic activity in natural capital backed currencies, any economic growth—increase in money circulation—would lead to a growth in preserved natural resources. Celo aims to be the layer 1 blockchain for natural capital assets, and Uniswap can be the natural capital DEX for these assets on Celo.\n\n### Proposal\n\nBlockchain technology can help address limit greenhouse gas emissions and promote sustainable practices by tokenizing carbon-sequestering assets such as rainforests. Those tokenized assets can then be purchased by individuals and businesses to democratize carbon offsetting and increase funding for environmental protection projects. We believe that together, Uniswap and Celo can lead the path to growing natural capital assets.\n\nUniswap on the Celo platform will:\n\n* Allow for the launch of green asset liquidity pools: With the launch of the [Climate Collective](https://climatecollective.org/), Celo community members proposed to allocate up to 40% of the reserve over time towards natural capital backed assets. A natural capital backed asset (also known as “green” or “regenerative finance” asset) is a tokenized representation of natural assets in the “real” world. An example of a green asset is a non-fungible carbon-negative initiative quantified in terms of fungible CO2 sequestered (e.g. tokenized carbon credits).\n* Advance the use of natural capital backed currencies: The Celo Reserve grows as demand for Celo stable currencies grows. And as the reserve grows, so does the allocation towards green assets. This creates a feedback mechanism: with increased adoption of Celo stable currencies the reserve programmatically generates demand for additional green assets, preserving rainforests, and other carbon-sequestering assets.\n* Use Uniswap as a decentralized mechanism to rebalance the reserve: The Celo reserve will not only need to rebalance its BTC, ETH, etc. holdings but also a variety of natural capital backed assets, such as tokenized land, forests, and carbon credits. If approved by Celo’s community governance, a 40% allocation at current reserve values would correspond to natural capital assets worth 200M USD held by the reserve alone, requiring an efficient and liquid trading counterpart. Currently, the reserve rebalances via centralized exchanges. Green assets are not held by centralized exchanges, and so a decentralized exchange is needed in order to rebalance the Celo reserve as demand for stable currencies increases.\n* Increase capital efficiency: Uniswap v3’s concentrated liquidity mechanism will be especially important for Celo’s stablecoins that trade within a small price range.\n* Create pathways for future green use cases: Market participants are actively exploring other use cases on Celo. A list of current projects is available on https://climatecollective.org/.\n\nThe Celo Foundation will commit $10M of CELO in Uniswap-specific user incentives & grants on Celo. In addition to the $10M in financial incentives for Uniswap specifically, the Celo Foundation will also focus on broader adoption of natural capital backed currencies and link this to ongoing efforts to making DeFi and crypto more accessible to the 6B smartphone users around the world through the following:\n\n* Promote the development of a mobile-first ecosystem through developer programs such as hackathons with Uniswap as a financial building block\n\n* Lead pilots and users research to help make Uniswap more accessible, especially in markets that lack access to basic financial tools and services.\n* Co-grant program to support projects that are launching and driving the growth of “green assets”\n\nWe propose a transparent measurement of this project's success through the following success criteria and long-term goals:\n\n* % of Celo Reserve allocated to green assets: 40% of the Celo Reserve (at current Celo Reserve levels this would correspond to $200M USD in green assets)\n* $ total TVL and TVL of associated green assets: 10x of Celo Reserve green asset holdings in circulation as LP\n* Impact of green assets in Celo Reserve: 17M tons of CO2 avoided or removed from the atmosphere (assuming an average price of $12 per ton and current Celo Reserve levels) , including all associated benefits (e.g. increase in biodiversity through protection of forests). This corresponds roughly to the annual absorption capacity of 1.7M hectares of forest area, or roughly the amount of [forest area lost in Brazil in 2020](https://www.globalforestwatch.org/blog/data-and-research/global-tree-cover-loss-data-2020/).\n\n### Conclusion\n\nCelo and Uniswap together can serve as the foundation for the proliferation of natural capital assets across Web3. We believe that the vision to advance climate and regenerative finance on Celo aligns with the Uniswap community. Thank you for your consideration and we welcome questions and suggestions. ",
        "choices": [
          "Yes",
          "No"
        ],
        "start": 1646927634,
        "end": 1647186834,
        "snapshot": "14359990",
        "state": "closed",
        "author": "0x13BDaE8c5F0fC40231F0E6A4ad70196F59138548",
        "scores": [
          12221585.71518538,
          602.7539361800001
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      },
      {
        "id": "0x92a16fbf16e7b113700bb2a20b3ca1b71ce678c4b818983e7412eb059cff776a",
        "title": "Consensus Check - Should Uniswap governance contribute funding to the Nomic Foundation?",
        "body": "## **Summary**\n\n* Nomic Labs, the team behind Hardhat, has become the Nomic Foundation, a non-profit organization dedicated to Ethereum. Our mission is to empower developers to decentralize the world.\n* The Nomic Foundation’s work will be focused on Ethereum’s developer platform with the objective of achieving a world-class developer experience, and generally improving Ethereum’s public goods support structures.\n* [Hardhat](https://hardhat.org/) is the de facto standard developer tool used to build Ethereum software, with more than 23000 Github repositories using it and tens of thousands of active users. Prominent teams relying on it include ENS, Uniswap, Optimism, OpenZeppelin, Aave, Balancer, Chainlink, Synthetix, and many more leading teams.\n* The new foundation will expand the Hardhat suite of tools and, most importantly, build long-term infrastructure to catalyze organic growth in the Ethereum tooling ecosystem, decreasing Ethereum’s dependence on any one organization to build and maintain core development platform components.\n* Seeking $30m in total funding from the ecosystem. Donations of $15M already secured by the Ethereum Foundation, Vitalik Buterin, Coinbase, a16z, The Graph, Polygon, Chainlink, a16z, and Kaszek Ventures.\n* **We’re proposing to Uniswap Governance to make a contribution of $5m to the Nomic Foundation to support its mission.**\n\n## **Nomic Foundation**\n\nNomic Labs has been fully dedicated to Ethereum developer experience since 2019, and we’re [now pivoting](https://medium.com/nomic-labs-blog/introducing-the-nomic-foundation-an-ethereum-public-goods-organization-31012af67df9) to a non-profit foundation formally dedicated to Ethereum. We’re aiming to build a long-lasting organization that makes Ethereum’s public goods support structures stronger by contributing to the Ethereum Foundation’s existing efforts, and reducing the ecosystem’s reliance on any one organization for development platform components.\n\n### **Roadmap**\n\nGiven the size and innovation pace of the ecosystem, there’s no way to foresee exactly what needs developers are going to have as things scale. However, we do know what engineering foundations the ecosystem will need in order to build its own solutions.\n\nOur overarching engineering strategy is to empower the ecosystem to build its own specialized tools. This plan is based on four strategic pillars of the stack, each of which offers an opportunity to leverage a platform to empower the ecosystem to keep building open-source infrastructure.\n\nFor each of these pillars, we will build a platform. The four ecosystem pillars and platform opportunities we’ve identified are:\n\n1. Solidity\n2. EVM tooling\n3. Local development environment\n4. Ethereum connector library\n\n## **The projects**\n\n### **Slang & Rethnet**\n\nOver the long term, these are our most important projects. Targeting the Solidity and EVM tooling pillars, Slang and Rethnet will serve as core infrastructure for the ecosystem to build new tools faster, cheaper, and better. We’re essentially building the tools that would have let us build Hardhat a lot faster. We previously published a [Medium post](https://medium.com/nomic-labs-blog/slang-rethnet-2ad465fd7880) with high-level descriptions of how both projects will complement each other.\n\n**Slang**\n\nA Solidity compiler designed as a platform for tooling development, an approach also known as compiler as a service. Its top priority will be servicing tools through domain-specific APIs. Much like .Net’s Roslyn, it will feature a compilation pipeline made of distinct reusable components with standalone APIs. A completely modular design guarantees that others can build on top of it by replacing the part of functionality they need to, and reusing everything else:\n\n1. Parser that is only concerned with producing trees from code. Usable on its own, for example, to create third-party formatters like Prettier plugins.\n2. Semantic analysis (binding) is concerned only with building a type system and validating the produced trees. Usable on its own, to implement third-party type checking, security/threat models, and more advanced third-party linting.\n3. Code generation. By replacing just this isolated part, the compiler can compile for different targets (e.g. non-EVM L2s).\n4. Language services. These will receive an immutable representation of the above (syntax trees, bound trees, codegen settings), and will only be tasked with answering questions. Usable on its own to expose in different IDEs (same service for VSCode, IntelliJ, Vim, etc). Reusable to extend the functionality of other editor features (task runners, testing, deployment, CI, debugging).\n5. Runtime observation APIs to support Rethnet.\n\nAll of this will be reusable to create entirely new EVM programming languages, since by replacing the parser and type system, one can get an entire high-quality toolchain working from the get-go.\n\n**Rethnet**\n\nTo provide a simulated environment where developers can build and test their Ethereum software, tools need to replicate many of the components that make up a full Ethereum node implementation. This is a significant engineering effort, which given the complexity of Ethereum, represents a barrier to entry to tooling development given the depth of knowledge that is required.\n\nRethnet aims to make this easier by offering a native, flexible, extensible, fast, and language-agnostic EVM local development network, distributed as a Rust library, that is designed to be the underlying core in tools that provide debugging information to developers (like Hardhat, Foundry, Remix, Truffle, DappTools, etc). It will be a Rust library made to be consumed from other languages like TypeScript, Go, Python, etc as a native dependency. It will implement the baseline of essential functionality every tool should have like Solidity console.log, stack traces, and descriptive error messages, as well as implement code coverage, gas profiling, and a step debugger. At its core, it’s an implementation of an Ethereum node with a layer of EVM runtime observation to provide development features.\n\nBuilding a new Hardhat, Truffle, Remix, or DappTools using Rethnet will be a much more manageable project, and Rethnet will be completely reusable for any EVM language through adapters.\n\n### **Hardhat**\n\nOur flagship project targets the local development environment pillar, and it’s currently at an advanced level of progress and adoption. While Slang and Rethnet mature and catalyze organic growth in the tooling space, developers still have needs to be met, positioning Hardhat as our immediate-term solution to empower developers to keep decentralizing the world.\n\nHardhat is an Ethereum development environment that developers use to compile, deploy, test, and debug Ethereum software. Most importantly, it’s highly flexible, extensible, and designed to empower the community to build their own solutions. This strategy has been successful, and there’s already [a valuable ecosystem of reusable plugins](https://hardhat.org/plugins/).\n\nHardhat’s roadmap is focused on becoming an extensible development environment with deep integrations across components in key areas of the tooling stack:\n\n* [Hardhat VSCode](https://medium.com/nomic-labs-blog/hardhat-vscode-9de29467fc26) — programming editor\n* [Hardhat Ignition](https://medium.com/nomic-labs-blog/hardhat-ignition-5a34a4e3d2de) — contract deployment\n* [Hardhat Network](https://hardhat.org/hardhat-network/) — local development network\n* [Hardhat Runner](https://hardhat.org/getting-started/#overview) — build/testing workflow\n\nThis roadmap leads to developers being well equipped to build powerful extensions to their workflow that increase their productivity according to their exact needs, and to then share them with the ecosystem in the form of plugins.\n\nHardhat will also eventually migrate to using Rethnet and Slang, increasing its feature richness, speed, and stability while enabling dogfooding at scale for our brand new building blocks.\n\n### **Web3.js as a frontend platform**\n\nThe OG Ethereum connector library, Web3.js, is being revitalized into a high-value project. By focusing on community and ecosystem growth, supported by an extensible architecture, it can become a great source of value, much like React represents in the front-end world, but for dapps. A website hub connecting community spaces, support spaces, educational resources, extensions, and related projects, combined with an active ecodev effort (workshops, talks, contests, and incentives), will create a source of leverage for the ecosystem. This will provide better troubleshooting, faster developer training, more reusable code, and, most importantly, the possibility of extending the library. This effort is currently spearheaded by the ChainSafe team.\n\n## **Funding**\n\nThe Nomic Foundation aims to benefit the entire Ethereum ecosystem, which is why we’re fundraising across multiple organizations and individuals within it.\n\nThe Ethereum Foundation is leading this round of contributions with $8M, alongside contributions from Vitalik Buterin, Coinbase, Consensys, The Graph, Polygon, Chainlink, Gnosis, a16z, a_capital, and Kaszek Ventures. These donors make up $15M, and we’re aiming to raise $15M more.\n\n## **Why Uniswap?**\n\nGenerally, we think that allocating capital to the Nomic Foundation makes strategic sense for any protocol treasury that is aligned long term with the growth of Ethereum, and we’ve approached and will continue approaching several protocols.\n\nCurrently, Uniswap [is built using Hardhat](https://github.com/Uniswap/v3-core/blob/main/hardhat.config.ts). While this is a signal of Hardhat’s value, the projects that the Nomic Foundation will deliver will create more value not just for Uniswap, but for the entire ecosystem. We’ll provide services to the Ethereum community that will:\n\n1. Continue the maintenance of critical infrastructure used to build most protocols (Hardhat).\n2. Increase developer productivity for every team in the ecosystem.\n3. Accelerate developer onboarding to Ethereum, increasing the size of the experienced engineering hiring pool and making time-to-productivity shorter for new hires.\n4. Accelerate the pace of innovation and the number of products being built.\n5. Increase market volume driven by new users and new products.\n\nWe believe this grows the market for everyone, including Uniswap, and we’d love to have the **Uniswap DAO contribute $5m in funding to this community effort** .",
        "choices": [
          "Yes",
          "No"
        ],
        "start": 1646653601,
        "end": 1647086400,
        "snapshot": "14339500",
        "state": "closed",
        "author": "0x8c64C3D24c4Df13B451D5BC9292b75E5dbA2e02A",
        "scores": [
          9125954.313457342,
          1270.2077619581585
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      },
      {
        "id": "0x85a309c742abb3daf8e2d73a6c940c5315b3bf42ab8a8b22340d6e91cb3e8bde",
        "title": "Should Uniswap governance contribute funding to the Nomic Foundation?",
        "body": "## **Summary**\n\n- Nomic Labs, the team behind Hardhat, has become the Nomic Foundation, a non-profit organization dedicated to Ethereum. Our mission is to empower developers to decentralize the world.\n- The Nomic Foundation's work will be focused on Ethereum's developer platform with the objective of achieving a world-class developer experience, and generally improving Ethereum's public goods support structures.\n- [Hardhat](https://hardhat.org/) is the de facto standard developer tool used to build Ethereum software, with more than 23000 Github repositories using it and tens of thousands of active users. Prominent teams relying on it include ENS, Uniswap, Optimism, OpenZeppelin, Aave, Balancer, Chainlink, Synthetix, and many more leading teams.\n- The new foundation will expand the Hardhat suite of tools and, most importantly, build long-term infrastructure to catalyze organic growth in the Ethereum tooling ecosystem, decreasing Ethereum's dependence on any one organization to build and maintain core development platform components.\n- Seeking $30m in total funding from the ecosystem. Donations of $15M already secured by the Ethereum Foundation, Vitalik Buterin, Coinbase, a16z, The Graph, Polygon, Chainlink, a16z, and Kaszek Ventures.\n- **We're proposing to Uniswap Governance to make a contribution of $5m to the Nomic Foundation to support its mission.**\n\n## **Ethereum developer experience**\n\nWhen it comes to Ethereum, which is primarily a software development platform to build decentralized systems, developer experience is a key strategic aspect for success. Ecosystem growth requires more developers to build more software on top of Ethereum. Developer adoption and learning speed, core contributors to this growth, are critically affected by developer experience.\n\nThe rate at which the ecosystem innovates, coming up with new creations and solving difficult problems, both at the dapp layer and EVM/Solidity/Vyper layer, is also directly affected by developer productivity.\n\nSoftware development platforms aren't new, and playbooks established by the great developer experience success stories (Rust, .Net, TypeScript, etc) prove that achieving a quality developer experience requires a specialized approach paired with a long-term, big-picture strategy. The potential impact in executing a dedicated effort for Ethereum would increase the ecosystem’s pace of innovation and growth, building a powerful compounding effect over the long term for the entire industry.\n\nThe inspiration for our vision came from our experience building Hardhat, which allowed us to see how deeply challenging it is to build sophisticated Ethereum tooling. **These challenges must be alleviated to bring about organic ecosystem-led improvement of developer experience that achieves world-class quality.**\n\n## **Nomic Foundation**\n\nNomic Labs has been fully dedicated to Ethereum developer experience since 2019, and we're [now pivoting](https://medium.com/nomic-labs-blog/introducing-the-nomic-foundation-an-ethereum-public-goods-organization-31012af67df9) to a non-profit foundation formally dedicated to Ethereum. We're aiming to build a long-lasting organization that makes Ethereum's public goods support structures stronger by contributing to the Ethereum Foundation's existing efforts, and reducing the ecosystem's reliance on any one organization for development platform components.\n\n### **Roadmap**\n\nGiven the size and innovation pace of the ecosystem, there's no way to foresee exactly what needs developers are going to have as things scale. However, we do know what engineering foundations the ecosystem will need in order to build its own solutions.\n\nOur overarching engineering strategy is to empower the ecosystem to build its own specialized tools. This plan is based on four strategic pillars of the stack, each of which offers an opportunity to leverage a platform to empower the ecosystem to keep building open-source infrastructure.\n\nFor each of these pillars, we will build a platform. The four ecosystem pillars and platform opportunities we've identified are:\n\n1. Solidity\n2. EVM tooling\n3. Local development environment\n4. Ethereum connector library\n\n## **The projects**\n\n### **Slang & Rethnet**\n\nOver the long term, these are our most important projects. Targeting the Solidity and EVM tooling pillars, Slang and Rethnet will serve as core infrastructure for the ecosystem to build new tools faster, cheaper, and better. We're essentially building the tools that would have let us build Hardhat a lot faster. We previously published a [Medium post](https://medium.com/nomic-labs-blog/slang-rethnet-2ad465fd7880) with high-level descriptions of how both projects will complement each other.\n\n**Slang**\n\nA Solidity compiler designed as a platform for tooling development, an approach also known as compiler as a service. Its top priority will be servicing tools through domain-specific APIs. Much like .Net's Roslyn, it will feature a compilation pipeline made of distinct reusable components with standalone APIs. A completely modular design guarantees that others can build on top of it by replacing the part of functionality they need to, and reusing everything else:\n\n1. Parser that is only concerned with producing trees from code. Usable on its own, for example, to create third-party formatters like Prettier plugins.\n2. Semantic analysis (binding) is concerned only with building a type system and validating the produced trees. Usable on its own, to implement third-party type checking, security/threat models, and more advanced third-party linting.\n3. Code generation. By replacing just this isolated part, the compiler can compile for different targets (e.g. non-EVM L2s).\n4. Language services. These will receive an immutable representation of the above (syntax trees, bound trees, codegen settings), and will only be tasked with answering questions. Usable on its own to expose in different IDEs (same service for VSCode, IntelliJ, Vim, etc). Reusable to extend the functionality of other editor features (task runners, testing, deployment, CI, debugging).\n5. Runtime observation APIs to support Rethnet.\n\nAll of this will be reusable to create entirely new EVM programming languages, since by replacing the parser and type system, one can get an entire high-quality toolchain working from the get-go.\n\n**Rethnet**\n\nTo provide a simulated environment where developers can build and test their Ethereum software, tools need to replicate many of the components that make up a full Ethereum node implementation. This is a significant engineering effort, which given the complexity of Ethereum, represents a barrier to entry to tooling development given the depth of knowledge that is required.\n\nRethnet aims to make this easier by offering a native, flexible, extensible, fast, and language-agnostic EVM local development network, distributed as a Rust library, that is designed to be the underlying core in tools that provide debugging information to developers (like Hardhat, Foundry, Remix, Truffle, DappTools, etc). It will be a Rust library made to be consumed from other languages like TypeScript, Go, Python, etc as a native dependency. It will implement the baseline of essential functionality every tool should have like Solidity console.log, stack traces, and descriptive error messages, as well as implement code coverage, gas profiling, and a step debugger. At its core, it's an implementation of an Ethereum node with a layer of EVM runtime observation to provide development features.\n\nBuilding a new Hardhat, Truffle, Remix, or DappTools using Rethnet will be a much more manageable project, and Rethnet will be completely reusable for any EVM language through adapters.\n\n### **Hardhat**\n\nOur flagship project targets the local development environment pillar, and it's currently at an advanced level of progress and adoption. While Slang and Rethnet mature and catalyze organic growth in the tooling space, developers still have needs to be met, positioning Hardhat as our immediate-term solution to empower developers to keep decentralizing the world.\n\nHardhat is an Ethereum development environment that developers use to compile, deploy, test, and debug Ethereum software. Most importantly, it's highly flexible, extensible, and designed to empower the community to build their own solutions. This strategy has been successful, and there's already [a valuable ecosystem of reusable plugins](https://hardhat.org/plugins/).\n\nHardhat's roadmap is focused on becoming an extensible development environment with deep integrations across components in key areas of the tooling stack:\n\n- [Hardhat VSCode](https://medium.com/nomic-labs-blog/hardhat-vscode-9de29467fc26) — programming editor\n- [Hardhat Ignition](https://medium.com/nomic-labs-blog/hardhat-ignition-5a34a4e3d2de) — contract deployment\n- [Hardhat Network](https://hardhat.org/hardhat-network/) — local development network\n- [Hardhat Runner](https://hardhat.org/getting-started/#overview) — build/testing workflow\n\nThis roadmap leads to developers being well equipped to build powerful extensions to their workflow that increase their productivity according to their exact needs, and to then share them with the ecosystem in the form of plugins.\n\nHardhat will also eventually migrate to using Rethnet and Slang, increasing its feature richness, speed, and stability while enabling dogfooding at scale for our brand new building blocks.\n\n### **Web3.js as a frontend platform**\n\nThe OG Ethereum connector library, Web3.js, is being revitalized into a high-value project. By focusing on community and ecosystem growth, supported by an extensible architecture, it can become a great source of value, much like React represents in the front-end world, but for dapps. A website hub connecting community spaces, support spaces, educational resources, extensions, and related projects, combined with an active ecodev effort (workshops, talks, contests, and incentives), will create a source of leverage for the ecosystem. This will provide better troubleshooting, faster developer training, more reusable code, and, most importantly, the possibility of extending the library. This effort is currently spearheaded by the ChainSafe team.\n\n## **Funding**\n\nThe Nomic Foundation aims to benefit the entire Ethereum ecosystem, which is why we’re fundraising across multiple organizations and individuals within it.\n\nThe Ethereum Foundation is leading this round of contributions with $8M, alongside contributions from Vitalik Buterin, Coinbase, Consensys, The Graph, Polygon, Chainlink, Gnosis, a16z, a_capital, and Kaszek Ventures. These donors make up $15M, and we're aiming to raise $15M more.\n\n## **Why Uniswap?**\n\nGenerally, we think that allocating capital to the Nomic Foundation makes strategic sense for any protocol treasury that is aligned long term with the growth of Ethereum, and we've approached and will continue approaching several protocols.\n\nCurrently, Uniswap [is built using Hardhat](https://github.com/Uniswap/v3-core/blob/main/hardhat.config.ts). While this is a signal of Hardhat’s value, the projects that the Nomic Foundation will deliver will create more value not just for Uniswap, but for the entire ecosystem. We’ll provide services to the Ethereum community that will:\n\n1. Continue the maintenance of critical infrastructure used to build most protocols (Hardhat).\n2. Increase developer productivity for every team in the ecosystem.\n3. Accelerate developer onboarding to Ethereum, increasing the size of the experienced engineering hiring pool and making time-to-productivity shorter for new hires.\n4. Accelerate the pace of innovation and the number of products being built.\n5. Increase market volume driven by new users and new products.\n\nWe believe this grows the market for everyone, including Uniswap, and we’d love to have the **Uniswap DAO contribute $5m in funding to this community effort**.",
        "choices": [
          "Yes",
          "No"
        ],
        "start": 1646221925,
        "end": 1646395200,
        "snapshot": "14307389",
        "state": "closed",
        "author": "0x8c64C3D24c4Df13B451D5BC9292b75E5dbA2e02A",
        "scores": [
          2507535.879266101,
          23.7
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      },
      {
        "id": "Qmcs5pAv7eGBzqGn1G8LJGusME3t7bTCSfZjdyWmw88LaM",
        "title": "Funding the Fee Switch Activation",
        "body": "Should the UNI governance allocate 0.3 – 1 M UNI to fund an organization to oversee and manage the application of the fee switch mechanism on Uniswap V3 and V2 protocols?\n",
        "choices": [
          "Yes",
          "No"
        ],
        "start": 1644775200,
        "end": 1645466400,
        "snapshot": "14195464",
        "state": "closed",
        "author": "0x6c34cFEA4870289198608460Be23B82fB71144aa",
        "scores": [
          13350.13901699644,
          6409561.714164416
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      },
      {
        "id": "0x68ed38529f4d81957cf30a3c441b93d321dcf14273c2e2f3aa32617bd1ac65fe",
        "title": "How should Uniswap community support \"Adopt unicorn on unicode\" proposal",
        "body": "Following the discussion the Uniswap community had during the community call 20 we came to conclusion that community likes this idea.\n\nHowever the technicalities of the execution itself are something to be discussed. If you check the unicode adoption website adopting a character can only be done via credit card. This means funds we raise need to be converted to FIAT and only then a payment can be made.\n\nApproaches we discussed are:\n\n1) Someone we trust in the community creates an address and everyone in the community can donate to that address. That person will then make a donation using credit card and they will be reimbursed with crypto assets we raise.\n\n2) Several members create a multisig and process is pretty much the same as 1)\n\n3) We utilize a PartyDAO (https://www.partybid.app/)  where either individual or several members put up an NFT for sale. If we reach a target and NFT is sold that funds can then be used in similar way as 1) and 2)\n\n4) Trusted member of the community makes a grant proposal to the UGP (https://www.unigrants.org/)\n\nDuring the community call it was agreed that BOR4 (myself) will make this vote on snapshot.\n\nPS if you don't have UNI delegated to you but you are still interested in participating you can also leave a comment on gov forum and we will take this feedback also in the account. ",
        "choices": [
          "individual creates an address",
          "committee with a multisig",
          "individual sells NFT on partybid",
          "committee sells NFT on partybid",
          "submission to the UGP"
        ],
        "start": 1644490800,
        "end": 1645095600,
        "snapshot": "14177738",
        "state": "closed",
        "author": "0xA7F63376169ccC087EB1160E62ceCcB146C1d555",
        "scores": [
          13811.76622801051,
          8028.525454760065,
          3,
          1,
          58.039700282088155
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      },
      {
        "id": "0xe3d59b3439ac0519b02ff39606e0ad571cc9fa7a05b334b6f87df09b2c883879",
        "title": "Temperature Check - Deploy Uniswap V3 on Harmony through an Additional Use Grant to Hermes DeFi",
        "body": "Dear Uniswap community,\n\nSince our initial proposal submission 9 days ago to bring Uniswap V3 technology to Harmony, we have seen an extremely positive response from both the Harmony and Uniswap communities. We have integrated community feedback and compiled a revised proposal and have posted it on the Uniswap governance forum: https://gov.uniswap.org/t/temperature-check-deploy-uniswap-v3-on-harmony-through-an-additional-use-grant-to-hermes-defi/16128\n\nIn summary, Hermes DeFi is requesting an Additional Use grant from Uniswap to deploy Uniswap V3 based smart contracts to power a new AMM/DEX on the Harmony blockchain.\n\nIn exchange for this permission, the Uniswap DAO will receive:\n1. A 10% allocation of HERMES tokens\n2. 25% of platform trading fees, returned as IRIS (decreasing 5% each year for the next 5 years)\n3. 50% of platform trading fees for the IRIS/1UNI pair, which will have a dedicated farm for the foreseeable future.\n4. 2% of IRIS supply (governance token of Hermes).\n5. Lending and borrowing support for 1UNI upon the launch of our lending market.\n6. The ability to bond 1UNI to earn HERMES as a mechanism of protocol-owned liquidity.\n",
        "choices": [
          "Yes, grant the license.",
          "No, do not grant the license."
        ],
        "start": 1644421200,
        "end": 1644853200,
        "snapshot": "14172713",
        "state": "closed",
        "author": "0x98e3623bCa45BF01D58E833811882777C8C015F8",
        "scores": [
          8370.853437946993,
          1742.828494209686
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      },
      {
        "id": "0xbfeb7f3c4a3f1d4979b59129f9a78ee217183b0656a480612d261233fb3f8c62",
        "title": "Consensus Check -  Should Uniswap Provide Voltz with v3 Additional Use Grant",
        "body": "Dear Uniswap Community,\n\nA few weeks ago, Voltz submitted a proposal to request for an “Additional Use Grant” from the Uniswap Community. This would allow Voltz to use aspects of the v3 code that is subject to a “Business Source License”. Voltz recognises the significant R&D that went into v3 and as a result is offering Uniswap Governance 1% of Voltz future tokens, alongside a number of non-financial benefits. The full proposal is available here https://gov.uniswap.org/t/should-uniswap-provide-voltz-with-v3-additional-use-grant/15669?u=simonj\n\nWe were delighted and humbled by the response from the Uniswap Community to our Temperature Check vote, with >99% voting in favour of our proposal! The Temperature Check also met the 25k UNI Yes threshold required to pass.  https://snapshot.org/#/uniswap/proposal/0x4f42b3215c4028edd947dc69980a9b8ba837ffbe3d0caa60d999406d634c8e79 \n\nWe are now kicking off the Consensus Check - the 2nd of 3 votes, which requires 50k UNI Yes votes to pass - with the community. https://gov.uniswap.org/t/consensus-check-should-uniswap-provide-voltz-with-v3-additional-use-grant/16012?u=simonj\n\nWe’re excited to see how the community votes! And we’re excited to make this happen and set a precedent for DeFi! \n\n\n**Voltz TL;DR**\n\nVoltz is a new DeFi primitive, bringing interest rate swaps to DeFi in a manner that is up to 3000x more capital efficient than alternative models. Voltz, therefore, is not a competitor to Uniswap but instead is complementary; interest rate swaps are a core pillar of well-functioning financial systems - so as Voltz grows it should help DeFi grow, which in turn should have second order benefits to Uniswap.\n",
        "choices": [
          "Yes",
          "No"
        ],
        "start": 1644224400,
        "end": 1644656400,
        "snapshot": "14154289",
        "state": "closed",
        "author": "0xFD4295c1A0b07e6b706f0Ab83dC9eB461b7f17B3",
        "scores": [
          3284888.2999831676,
          403
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      },
      {
        "id": "0x4f42b3215c4028edd947dc69980a9b8ba837ffbe3d0caa60d999406d634c8e79",
        "title": "Temperature Check - Should Uniswap Provide Voltz with v3 Additional Use Grant?",
        "body": "Dear Uniswap Community,\n\nThe Voltz Labs team recently submitted a proposal to request for an “Additional Use Grant” from Uniswap governance. This would allow Voltz to use aspects of the Uniswap v3 code that is subject to the “Business Source License”.\n\nVoltz is a new DeFi primitive, bringing interest rate swaps to DeFi in a manner that is up to 3000x more capital efficient than alternative models. Voltz, therefore, is not a competitor to Uniswap but instead is complementary; interest rate swaps are a core pillar of well-functioning financial systems - so as Voltz grows it should help DeFi grow, which in turn should have second order benefits to Uniswap.\n\nThat said, the Voltz Labs team recognise the significant R&D that went into v3 and as a result are offering Uniswap governance 1% of Voltz future tokens alongside a number of additional non-financial benefits. The full proposal, and discussion, can be found here: https://gov.uniswap.org/t/should-uniswap-provide-voltz-with-v3-additional-use-grant/15669?u=simonj\n\nFollowing positive feedback, including the discussion with the Voltz Labs founders on the Uniswap discord community call last week, we are now initiating the Temperate Check with the Uniswap community.\n\nWe’re excited to see how the community votes. And excited about the opportunity to make this happen and set a precedent for DeFi!\n",
        "choices": [
          "Yes",
          "No"
        ],
        "start": 1642582800,
        "end": 1642842000,
        "snapshot": "14031057",
        "state": "closed",
        "author": "0xFD4295c1A0b07e6b706f0Ab83dC9eB461b7f17B3",
        "scores": [
          235389.28838682565,
          423.95782696824176
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      },
      {
        "id": "0x1994d4598b81dbb511bc7068f65a12fdf0ddbf2b26f5b7313e087750c5f9c0b7",
        "title": "Temperature Check—Support izumi Finance as Uniswap V3 official partner of Liquidity Mining Platform",
        "body": "1. izumi Finance offered \"Programmable Liquidity as a Service\" on Uniswap V3, which has much higher capital efficiency than the traditional Liquidity Mining program. \n2. Uniswap Labs could partner with izumi Finance to cost-free provide Liquidity Mining program supports for any trading pair on Uniswap V3.\n\nFor More info, you could check Uniswap Governance Forum.\n",
        "choices": [
          "YES",
          "NO"
        ],
        "start": 1639540800,
        "end": 1640059200,
        "snapshot": "13807789",
        "state": "closed",
        "author": "0x9997d7120862CEda99aB4a1c43698e0941F87b20",
        "scores": [
          10167.85688022227,
          3012840.2050210303
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      },
      {
        "id": "0xc1aec11c9ac5698920072a5de807284a56becbadfb7bef68b2618ad00e61547c",
        "title": "Consensus check - Should Uniswap incentivize liquidity on Optimism and Arbitrum? ",
        "body": "Dear Uniswap community,\n\nTwo weeks ago I submitted a proposal for Uniswap to incentivize liquidity on L2's to make its deployment on L2's a success and help kickstart L2 adoption.\n\nI am hereby re-submitting the proposal after it passed the temperature check. This proposal includes many details on how to execute the liquidity mining program.\n\nForum post: https://gov.uniswap.org/t/consensus-check-should-uniswap-incentivize-liquidity-on-optimism-and-arbitrum/15288",
        "choices": [
          "Yes",
          "No"
        ],
        "start": 1638282600,
        "end": 1638536400,
        "snapshot": "13714511",
        "state": "closed",
        "author": "0x79C4213a328E3B4F1D87b4953C14759399dB25E2",
        "scores": [
          19711622.200489502,
          215036.99055142343
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      },
      {
        "id": "0xe869bc63ed483f00c520129724934a206b433dec613a498100e25f9f10fbeac7",
        "title": "Consensus Check - Should Uniswap v3 be deployed to Polygon?",
        "body": "Dear Uniswap community,\n\nRoughly a week ago, we (the Polygon team) submitted an official proposal to deploy Uniswap v3 to Polygon PoS: https://gov.uniswap.org/t/deploy-uniswap-v3-to-polygon-pos-chain/15058.\n\nTemperature Check, the first phase of the governance process, went exceptionally well; 7.79M UNI (~100%) voted yes, orders of magnitude more than the required 25k UNI quorum!\n\nWe are now initiating Consensus Check, the second (out of three) phase of the governance process: https://gov.uniswap.org/t/consensus-check-deploy-uniswap-v3-to-polygon-pos-chain/15262\n\nWe kindly ask for your support. Let's make this happen!\n\n\n\n",
        "choices": [
          "Yes",
          "No"
        ],
        "start": 1638144000,
        "end": 1638489600,
        "snapshot": "13705628",
        "state": "closed",
        "author": "0xAc61FfD736EdF06D0E2CDFac99d22a189d9ad620",
        "scores": [
          44033742.1611962,
          501031.9398521838
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      },
      {
        "id": "0xfb9841f0cd2111b078ffbcc9efe5a0d552907ee290b0851c8d69350b26530ed0",
        "title": "Is uniswap supported to accelerate layer2?",
        "body": "As we all know, the gas price has been very high, which has seriously affected people's trading frequency,\n\nIs uniswap supported to accelerate layer2?",
        "choices": [
          "support",
          "veto"
        ],
        "start": 1637971200,
        "end": 1639612800,
        "snapshot": "13688268",
        "state": "closed",
        "author": "0x954933147Bf9e6a919C8822aE36D98868026606f",
        "scores": [
          2511597.5915212566,
          212094.64535303533
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      },
      {
        "id": "0x47a6eed75673f33e8eb5d7abbfc0279d8c113ec7fa51f8b61c1abcd66dc091c6",
        "title": "Should Uniswap v3 be deployed to Polygon?",
        "body": "Dear Uniswap community,\n\nThe Polygon team submitted a proposal to deploy Uniswap V3 to Polygon PoS chain: https://gov.uniswap.org/t/deploy-uniswap-v3-to-polygon-pos-chain/15058\n\nWe firmly believe this is the right moment for this deployment to happen, for reasons explained in the proposal. We are willing to actively support Uniswap on Polygon (financially and otherwise) and we are convinced it would be a huge success!\n\nLet's make this happen!\n\n",
        "choices": [
          "Yes",
          "No"
        ],
        "start": 1637575200,
        "end": 1637834400,
        "snapshot": "13666370",
        "state": "closed",
        "author": "0xAc61FfD736EdF06D0E2CDFac99d22a189d9ad620",
        "scores": [
          7788589.570368258,
          101
        ],
        "space": {
          "id": "uniswap",
          "name": "Uniswap"
        }
      }
    ]
  }
}